backend/controllers/BookingController.php

    public function actionCheckLog($id_payment){
        if(($modelLogPayment = TPaymentLog::find()->joinWith(['idUser','idEvent'])->where(['id_payment'=>$id_payment])->asArray()->all()) != null){
---
SELECT `t_payment_log`.* FROM `t_payment_log` LEFT JOIN `user` ON `t_payment_log`.`id_user` = `user`.`id` LEFT JOIN `t_booking_log_event` ON `t_payment_log`.`id_event` = `t_booking_log_event`.`id` WHERE `id_payment`=146

    public function actionCheckLogBooking($id_booking){
        if(($modelLogBooking = TBookingLog::find()->joinWith(['idUser','idEvent'])->where(['id_booking'=>$id_booking])->asArray()->all()) != null){
---
SELECT `t_booking_log`.* FROM `t_booking_log` LEFT JOIN `user` ON `t_booking_log`.`id_user` = `user`.`id` LEFT JOIN `t_booking_log_event` ON `t_booking_log`.`id_event` = `t_booking_log_event`.`id` WHERE `id_booking`='GUI1I'

protected function findAllBooking(){
    if(Helper::checkRoute('/booking/*')){
        return TBooking::find()->where(['between','id_status',4,6])->all();
---
SELECT * FROM `t_booking` WHERE `id_status` BETWEEN 4 AND 6

    public function actionIndex()
    {
        $searchModel = new TBookingSearch();
        $dataProvider = $searchModel->summarySearch(Yii::$app->request->queryParams);
        $findPassengers = TPassenger::find();
        $listCompany = ArrayHelper::map(TCompany::find()->asArray()->all(), 'id', 'name');
        foreach ($this->findAllBooking() as $key => $value) {
            $res[] = $value->id;
        }
        if(Helper::checkRoute('/booking/*')){
            $listDept = ArrayHelper::map(THarbor::find()->all(), 'id', 'name', 'idIsland.island');
            $listBuyer = ArrayHelper::map(TPayment::find()->asArray()->groupBy(['name'])->all(), 'name', 'name');
---
SELECT * FROM `t_company`
SELECT * FROM `t_harbor`
SELECT * FROM `t_island` WHERE `id`=1
SELECT * FROM `t_payment` GROUP BY `name`