backend/controllers/PrivateBookingController.php

    public function actionCheckLogPayment($id_payment){
        if(($modelLogPayment = TPaymentLog::find()->joinWith(['idUser','idEvent','idPayment'])->where(['id_payment'=>$id_payment,'t_payment.id_payment_type'=>2])->asArray()->all()) != null){
---
SELECT `t_payment_log`.* FROM `t_payment_log` LEFT JOIN `user` ON `t_payment_log`.`id_user` = `user`.`id` LEFT JOIN `t_booking_log_event` ON `t_payment_log`.`id_event` = `t_booking_log_event`.`id` LEFT JOIN `t_payment` ON `t_payment_log`.`id_payment` = `t_payment`.`id` WHERE (`id_payment`=182) AND (`t_payment`.`id_payment_type`=2)

    public function actionCheckLogBooking($id_booking){
        if(($modelLogBooking = TPrivateBookingLog::find()->joinWith(['idUser','idEvent','idBooking'])->where(['id_booking'=>$id_booking])->asArray()->all()) != null){
---
SELECT `t_private_booking_log`.* FROM `t_private_booking_log` LEFT JOIN `user` ON `t_private_booking_log`.`id_user` = `user`.`id` LEFT JOIN `t_booking_log_event` ON `t_private_booking_log`.`id_event` = `t_booking_log_event`.`id` LEFT JOIN `t_private_booking` ON `t_private_booking_log`.`id_booking` = `t_private_booking`.`id` WHERE `id_booking`='PG99FX'