backend/controllers/SiteController.php

SELECT * FROM `t_booking`
---
    public function actionIndex()
    {
        $modelBooking = TBooking::find()->all();