frontend/controllers/ContentController.php

     protected function findModelArray($slug)
    {
        if (($model = TContent::find()->where(['slug'=>$slug])->asArray()->one()) !== null) {
---
SELECT * FROM `t_content` WHERE `slug`='kuda-hitam'