frontend/controllers/PaymentController.php

    protected function findPayment($token){
        if (($payment = TPayment::findOne(['token'=>$token])) !== null) {
---
SELECT * FROM `t_payment` WHERE `token`='584VSN48NJIDYFQPGGGFL4XWA'

    public function actionRenderPaypalButton(){
         $session       = Yii::$app->session;
         $modelpembayaranPaypal = TPayment::find()->where(['token'=>$session['token']])->asArray()->one();
---
SELECT * FROM `t_payment` WHERE `token`='584VSN48NJIDYFQPGGGFL4XWA'