frontend/controllers/SiteController.php

SELECT * FROM `t_content` WHERE `id_type_content`=4 ORDER BY `updated_at` DESC LIMIT 4
---
        $childList = ['0','1','2','3','4','5'];
        $now = date('d-m-Y');
        $limitdate = date('d-m-Y',strtotime('+1 days',strtotime($now)));
        $listBoats = TContent::find()->where(['id_type_content'=>1])->orderBy(['updated_at'=>SORT_DESC])->limit(4)->all();