common/components/BookingForm.php

SELECT `t_harbor`.* FROM `t_harbor` LEFT JOIN `t_island` ON `t_harbor`.`id_island` = `t_island`.`id` WHERE `t_harbor`.`id_island` != 1
---
    public function renderView(){
    	if ($this->formType === self::FASTBOAT) {
    		$session =Yii::$app->session;
			$modelBookForm = new BookForm();
			$session->open();
	        $listCurrency = ArrayHelper::map(TKurs::getCurrencyAsArray(), 'currency', 'currency_name','name');
	        $route = THarbor::find()->joinWith('idIsland')->where(['!=','t_harbor.id_island',1])->asArray()->all();