common/components/Gilitransfers.php

SELECT COUNT(*) FROM (SELECT `t_booking`.* FROM `t_booking` LEFT JOIN `t_payment` ON `t_booking`.`id_payment` = `t_payment`.`id` WHERE (`t_payment`.`id_payment_method`=2) AND (`t_booking`.`id_status` BETWEEN 2 AND 3) GROUP BY `id_payment`) `c`
---
	public function Valbook(){
		return TBooking::find()->joinWith('idPayment')->where(['t_payment.id_payment_method'=>2])->andWhere(['between','t_booking.id_status',2,3])->groupBy('id_payment')->count();

SELECT * FROM `t_cart` WHERE `session_key` IS NULL
---
	public function Countcart(){
		 $session       = Yii::$app->session;
        return count(TCart::find()->where(['session_key'=>$session['session_key']])->all());

INSERT INTO `t_visitor` (`ip`, `id_country`, `region`, `city`, `id_timezone`, `latitude`, `longitude`, `url`, `user_agent`, `created_at`) VALUES ('127.0.0.1', 'ID', '', '', 0, '0', '0', '/payment/thank-you', 'Mozilla/5.0 (X11; Ubuntu; Linux x86_64; rv:57.0) Gecko/20100101 Firefox/57.0', 2018)
---
	public function trackFrontendVisitor($url){
		$userAgent = Yii::$app->request->userAgent;
		$userIP = Yii::$app->request->userIP;

		$info = file_get_contents('http://freegeoip.net/json/'.$userIP);
		$infoArray = Json::decode($info);
		$transaction = Yii::$app->db->beginTransaction();
		try {
			$now = date('Y-m-d H:i:s');
			$modelVisitor = new TVisitor();
			$modelVisitor->ip = $infoArray['ip'];
			$modelVisitor->id_country = $infoArray['country_code'] = null ? $infoArray['country_code'] : "ID";
			$modelVisitor->region = $infoArray['region_name'];
			$modelVisitor->city = $infoArray['city'];
			$modelVisitor->id_timezone = $modelVisitor->findTimeZone($infoArray['time_zone']);
			$modelVisitor->latitude = $infoArray['latitude'];
			$modelVisitor->longitude = $infoArray['longitude'];
			$modelVisitor->url = $url;
			$modelVisitor->user_agent = $userAgent;
			$modelVisitor->created_at = $now;
			$modelVisitor->created_at = $now;
			$modelVisitor->save(false);