common/models/TKurs.php

    public static function getCurrencyAsArray(){
        return TKurs::find()->select(['currency','name','CONCAT(currency, " - ",name) AS currency_name'])->asArray()->orderBy(['currency'=>SORT_ASC])->all();
---
SELECT `currency`, `name`, CONCAT(currency, " - ",name) AS currency_name FROM `t_kurs` ORDER BY `currency`