common/models/TMailQueue.php

INSERT INTO `t_mail_queue` (`id_payment`, `status`, `id_type`) VALUES (183, 1, 1)
---
    public static function addTicketQueue($id_payment,$type){
        $modelQueue = new TMailQueue();
        $modelQueue->id_payment = $id_payment;
        $modelQueue->status = self::STATUS_QUEUE;
        $modelQueue->id_type = $type; // Type E Ticket
        $modelQueue->save(false);