common/models/TPaypalPayer.php

    public static function checkPayer(array $arrayPayer){
        if (($modelPayer = TPaypalPayer::findOne($arrayPayer['payer_info']['payer_id'])) !== null ) {
---
SELECT * FROM `t_paypal_payer` WHERE `id`='J6HNCKBADB4MG'