common/models/TPayment.php

SELECT `t_payment`.* FROM `t_payment` LEFT JOIN `t_bank_transfer_transaction` ON `t_payment`.`token` = `t_bank_transfer_transaction`.`payment_token` WHERE `token` IS NULL
---
    public static function getArrayPaymentByToken($token){
        return TPayment::find()->joinWith(['bankTransfer'])->where(['token'=>$token])->asArray()->one();