common/models/TPaypalStatus.php

SELECT * FROM `t_paypal_status` WHERE `status`='completed'
---
    public static function checkStatus($status){
        if (($modelStatus = TPaypalStatus::find()->where(['status'=>$status])->asArray()->one()) !== null) {