common/models/TPaypalIntent.php

    public static function checkIntent($intent){
        if (($modelIntent = TPaypalIntent::find()->where(['intent'=>$intent])->asArray()->one()) !== null) {
---
SELECT * FROM `t_paypal_intent` WHERE `intent`='sale'