common/models/TPaypalTransaction.php

    public function afterSave($insert, $changedAttributes)
    {
            $modelpembayaranPaypal = $this->paymentToken;
            if ($this->paymentToken->id_payment_type == 1) {
              $modelBooking          = $this->paymentToken->tBookings;
            }elseif ($this->paymentToken->id_payment_type == 2) {
              $modelBooking          = $this->paymentToken->tPrivateBookings;
            }

            if ($this->id_status == self::EVENT_SALE_COMPLETED) {

               $statusPayment = $modelpembayaranPaypal::STATUS_CONFIRM_RECEIVED;
               $statusBooking = $modelpembayaranPaypal::STATUS_PARTIAL_REFUND; //SUKSES

               foreach ($modelBooking as $key => $valBooking) {
                  $valBooking->id_status = $statusBooking;
                  $valBooking->validate();
                  $valBooking->save(false);
                 }
                 $modelpembayaranPaypal->id_payment_method = $modelpembayaranPaypal::STATUS_UNCONFIRMED; //PAYPAL
                 $modelpembayaranPaypal->status            = $statusPayment;
                 $modelpembayaranPaypal->validate();
                 $modelpembayaranPaypal->save(false);
---
UPDATE `t_booking` SET `id_status`=5 WHERE `id`='F6GRJW'
UPDATE `t_payment` SET `status`=4, `id_payment_method`=1 WHERE `id`=183

    public static function addTransactionData(array $data){
        $arrayTransaction                          = $data['transactions'][0]['related_resources'][0]['sale'];
        if (($modelPaypalTransaction               = TPaypalTransaction::findOne($arrayTransaction['id'])) === null) {
            $PayerId                               = TPaypalPayer::checkPayer($data['payer']);
            $modelPaypalTransaction                = new TPaypalTransaction();
            $modelPaypalTransaction->id            = $arrayTransaction['id'];
            $modelPaypalTransaction->id_payer      = $PayerId;
            $modelPaypalTransaction->amount        = $arrayTransaction['amount']['total'];
            $modelPaypalTransaction->currency      = $arrayTransaction['amount']['currency'];
            $modelPaypalTransaction->description   = $data['transactions'][0]['item_list']['items'][0]['name'];
            $modelPaypalTransaction->id_intent     = TPaypalIntent::checkIntent($data['intent']);
            $modelPaypalTransaction->id_status     = TPaypalStatus::checkStatus($arrayTransaction['state']);
            $modelPaypalTransaction->payment_token = $data['transactions'][0]['item_list']['items'][0]['description'];
            $modelPaypalTransaction->paypal_time   = $data['create_time'];
            $modelPaypalTransaction->datetime      = date('Y-m-d H:i:s');
            $modelPaypalTransaction->save(false);
---
SELECT * FROM `t_paypal_transaction` WHERE `id`='81A076344S0634716'
INSERT INTO `t_paypal_transaction` (`id`, `id_payer`, `amount`, `currency`, `description`, `id_intent`, `id_status`, `payment_token`, `paypal_time`, `datetime`) VALUES ('81A076344S0634716', 'J6HNCKBADB4MG', 83, 'USD', 'Payment Fastboat Gilitransfers From : test customer | mastuyink94@gmail.com', 1, 1, '584VSN48NJIDYFQPGGGFL4XWA', '2018-01-12T03:39:22Z', '2018-01-12 11:39:23')