common/models/TPrivateLocation.php

SELECT * FROM `t_private_location`
---
    public static function getAllLocation(){
        return TPrivateLocation::find()->asArray()->all();