common/models/TVisitor.php

    public function findTimeZone($time_zone){
        if (($modelTimezone = TTimezone::find()->where(['timezone'=>$time_zone])->one()) != null) {
---
SELECT * FROM `t_timezone` WHERE `timezone`=''